export const specializationsBySpecialityCode = {
  A4: [
    { code: "A4.00", name: "Хореографія" },
    { code: "A4.01", name: "Українська мова і література" },
    { code: "A4.011", name: "Кримськотатарська мова і література" },
    { code: "A4.021", name: "Англійська мова та зарубіжна література" },
    { code: "A4.022", name: "Німецька мова та зарубіжна література" },
    { code: "A4.023", name: "Французька мова та зарубіжна література" },
    { code: "A4.024", name: "Іспанська мова та зарубіжна література" },
    { code: "A4.026", name: "Угорська мова та зарубіжна література" },
    { code: "A4.027", name: "Румунська мова та зарубіжна література" },
    { code: "A4.028", name: "Польська мова та зарубіжна література" },
    { code: "A4.029", name: "Інші мови (із зазначенням мови) та зарубіжна література" },
    { code: "A4.03", name: "Історія та громадянська освіта" },
    { code: "A4.04", name: "Математика" },
    { code: "A4.05", name: "Біологія та здоров’я людини" },
    { code: "A4.06", name: "Хімія" },
    { code: "A4.07", name: "Географія" },
    { code: "A4.08", name: "Фізика та астрономія" },
    { code: "A4.09", name: "Інформатика" },
    { code: "A4.10", name: "Технології" },
    { code: "A4.11", name: "Фізична культура" },
    { code: "A4.12", name: "Мистецтво. Образотворче мистецтво" },
    { code: "A4.13", name: "Мистецтво. Музичне мистецтво" },
    { code: "A4.15", name: "Природничі науки" },
    { code: "A4.16", name: "Захист України" }
  ],
  A5: [
    { code: "A5.00", name: "Дизайн" },
    { code: "A5.00", name: "Сфера обслуговування" },
    { code: "A5.00", name: "Товарознавство" },
    { code: "A5.31", name: "Будівництво та зварювання" },
    { code: "A5.32", name: "Електроніка, метрологія та радіотелекомунікації" },
    { code: "A5.33", name: "Енергетика, електротехніка та електромеханіка" },
    { code: "A5.34", name: "Машинобудування" },
    { code: "A5.35", name: "Видобуток, переробка та транспортування корисних копалин" },
    { code: "A5.36", name: "Технологія виробів легкої промисловості" },
    { code: "A5.37", name: "Аграрне виробництво, переробка сільськогосподарської продукції та харчові технології" },
    { code: "A5.38", name: "Транспорт" },
    { code: "A5.39", name: "Цифрові технології" }
  ],
  A6: [
    { code: "A6.01", name: "Логопедія" },
    { code: "A6.02", name: "Корекційна психопедагогіка" },
    { code: "A6.03", name: "Ортопедагогіка" },
    { code: "A6.04", name: "Сурдопедагогіка" },
    { code: "A6.05", name: "Тифлопедагогіка" }
  ],
  B1: [
    { code: "B1.01", name: "Аудіовізуальне мистецтво" },
    { code: "B1.02", name: "Кіно-, медіавиробництво" },
    { code: "B1.03", name: "Звукорежисура" },
    { code: "B1.04", name: "Кіно-, медіазнавство" }
  ],
  B11: [
    { code: "B11.01", name: "Українська мова та література" },
    { code: "B11.02", name: "Кримськотатарська мова та література" },
    { code: "B11.033", name: "Слов’янські мови та літератури (переклад включно), перша - польська" },
    { code: "B11.034", name: "Слов’янські мови та літератури (переклад включно), перша - російська" },
    { code: "B11.035", name: "Слов’янські мови та літератури (переклад включно), перша - сербська" },
    { code: "B11.036", name: "Слов’янські мови та літератури (переклад включно), перша - словацька" },
    { code: "B11.037", name: "Слов’янські мови та літератури (переклад включно), перша - хорватська" },
    { code: "B11.038", name: "Слов’янські мови та літератури (переклад включно), перша - чеська" },
    { code: "B11.039", name: "Слов’янські мови та літератури (переклад включно), перша - словенська" },
    { code: "B11.041", name: "Германські мови та літератури (переклад включно), перша - англійська" },
    { code: "B11.043", name: "Германські мови та літератури (переклад включно), перша - німецька" },
    { code: "B11.044", name: "Германські мови та літератури (переклад включно), перша - шведська" },
    { code: "B11.051", name: "Романські мови та літератури (переклад включно), перша - іспанська" },
    { code: "B11.052", name: "Романські мови та літератури (переклад включно), перша - італійська" },
    { code: "B11.053", name: "Романські мови та літератури (переклад включно), перша - португальська" },
    { code: "B11.055", name: "Романські мови та літератури (переклад включно), перша - французька" },
    { code: "B11.060", name: "Східні мови та літератури (переклад включно), перша - арабська" },
    { code: "B11.062", name: "Східні мови та літератури (переклад включно), перша - ґінді" },
    { code: "B11.063", name: "Східні мови та літератури (переклад включно), перша - іврит" },
    { code: "B11.065", name: "Східні мови та літератури (переклад включно), перша - китайська" },
    { code: "B11.066", name: "Східні мови та літератури (переклад включно), перша - корейська" },
    { code: "B11.067", name: "Східні мови та літератури (переклад включно), перша - перська" },
    { code: "B11.068", name: "Східні мови та літератури (переклад включно), перша - турецька" },
    { code: "B11.069", name: "Східні мови та літератури (переклад включно), перша - японська" },
    { code: "B11.071", name: "Угро-фінські мови та літератури (переклад включно), перша - угорська" },
    { code: "B11.08", name: "Класичні мови та літератури (переклад включно)" },
    { code: "B11.081", name: "Новогрецька мова і література (переклад включно)" },
    { code: "B11.09", name: "Фольклористика" },
    { code: "B11.10", name: "Прикладна лінгвістика" }
  ],
  B2: [
    { code: "B2.01", name: "Графічний дизайн" },
    { code: "B2.02", name: "Промисловий дизайн" },
    { code: "B2.03", name: "Дизайн середовища" },
    { code: "B2.04", name: "Дизайн костюму" }
  ],
  B4: [
    { code: "B4.01", name: "Візуальні мистецтва" },
    { code: "B4.02", name: "Реставрація" },
    { code: "B4.03", name: "Мистецтвознавство" }
  ],
  B6: [
    { code: "B6.01", name: "Сценічне мистецтво" },
    { code: "B6.02", name: "Циркове мистецтво" },
    { code: "B6.03", name: "Хореографічне мистецтво" }
  ],
  C1: [
    { code: "C1.01", name: "Економіка" },
    { code: "C1.02", name: "Міжнародні економічні відносини" }
  ],
  G11: [
    { code: "G11.01", name: "Верстати та інструменти" },
    { code: "G11.02", name: "Двигуни та енергетичні установки" },
    { code: "G11.03", name: "Технологічні машини та обладнання" },
    { code: "G11.04", name: "Суднобудування" },
    { code: "G11.05", name: "Транспортні засоби" }
  ],
  G4: [
    { code: "G4.01", name: "Атомна енергетика" },
    { code: "G4.02", name: "Теплоенергетика" },
    { code: "G4.03", name: "Відновлювані джерела енергії та гідроенергетика" },
    { code: "G4.04", name: "Холодильні та кліматичні технології" }
  ],
  I5: [
    { code: "I5.01", name: "Медсестринство" },
    { code: "I5.02", name: "Екстрена медицина" }
  ],
  I6: [
    { code: "I6.01", name: "Лабораторна діагностика" },
    { code: "I6.02", name: "Протезування-ортезування" }
  ],
  I7: [
    { code: "I7.01", name: "Фізична терапія" },
    { code: "I7.02", name: "Ерготерапія" },
    { code: "I7.03", name: "Терапія мови і мовлення" }
  ],
  I8: [
    { code: "I8.01", name: "Фармація" },
    { code: "I8.02", name: "Промислова фармація" }
  ],
  J5: [
    { code: "J5.01", name: "Навігація і управління морськими суднами" },
    { code: "J5.02", name: "Управління судновими технічними системами і комплексами" },
    { code: "J5.03", name: "Експлуатація суднового електрообладнання і засобів автоматики" },
    { code: "J5.04", name: "Судноводіння на внутрішніх водних шляхах" },
    { code: "J5.05", name: "Транспортні технології на морському та внутрішньому водному транспорті" }
  ]
} as const;

export type SpecializationRow = {
  code: string;
  name: string;
};
